/*
 * Отчёт по анализу – 
 * нелинейной взаимосвязанной темпло- и массообменной модели(НВТММ)(NETFM)
 * представленной в ПМ(Graphs(5part)) и Simulink модели(Full_RC_EVOP).
 * 
 * Примечание: в Simulink модели(Full_RC_EVOP) не участвует Испаритель.
 */

//---------------------------------------------------------

/************Анализ ПМ:************/

/************Условия:************/

// Модель:
// -----Model's heat exchenger parameters------
double RvT = 0.0191806, RfT = 0.0000777, a0 = 0.00016966,
        PTV_L = (a0 * 273.15 * dt) / defaultH,
        PTF = (0.0002291314 * dt) / defaultH;

// -----Model's mass exchenger parameters------
double E = 0.000000001, //RfM = 0.000010734, RvM = 0.0216487318;
						RvM = 0.004302, RfM = 0.00001222;

// -----Calculate layer heat exchenger model------
PTV_N = (a0*TV[i-1][j+1] * dt) / defaultH;
TV[i][j] = -TV[i-1][j] * (PTV_L - 1 - PTV_N + dt*RvT)
						+ (PTV_L * TV[i-1][j-1]) - (PTV_N * TV[i-1][j+1])
            			+ (dt * RvT * TF[i-1][(selectZ-1)-j])
            			+ P_TV;  // + perturbation of the temperature(P_TV = 0)
TF[i][j] = -TF[i-1][j] * (PTF - 1 + dt*RfT)
						+ (PTF * TF[i-1][j-1])
						+ (dt * RfT * TV[i-1][(selectZ-1)-j])
						+ P_TF; // (P_TF = 0)

// -----Calculate layer mass exchenger model------
CV[i][j] = -CV[i-1][j] * (PTV_L - 1 - PTV_N - dt*RvM)
						+ (PTV_L * CV[i-1][j-1])
						- (PTV_N * CV[i-1][j+1])
                        - (dt * RvM * E * CF[i-1][(selectZ-1)-j])
                        + P_CV; // (P_CV = 0)
CF[i][j] = -CF[i-1][j] * (PTF - 1 - (dt*RfM*E))
						+ (PTF * CF[i-1][j-1])
						- (dt * RfM * CV[i-1][(selectZ-1)-j])
						+ P_CF; // (P_CF = 0)

// Модель с н.у.:
const double initLayerTV_0 = 160, initLayerTV_1 = 147.99;
const double initLayerTF_0 = 120.37, initLayerTF_1 = 132.39;
const double initLayerCV_0 = 67.94, initLayerCV_1 = 72.04;
const double initLayerCF_0 = 6.5, initLayerCF_1 = 2.78;

// Шаг дискретизации по времени:
double dt = 0.01;

// Шаг дискретизации по пространству:
static double defaultH = dRC/selectZ;	// dRC = 1.4m; selectZ = 3

/************Результаты моделирования:************/

// Установившиеся значения (при RvM = 0.004302, RfM = 0.00001222):
TV[i][j] = 156.494; 153.622; 148.457 
TF[i][j] = 123.79; 126.958; 129.986

CV[i][j] = 71.1377; 70.9321; 76.8917
CF[i][j] = 4.58631; 2.82093; 1.05045

// Время отрисовки графиков
t_render = 46.34 sec

// Конечное время моделирование(совпадает с конечн. врем. модел. ПМ)
simulation_time = 100000.0

//---------------------------------------------------------
//---------------------------------------------------------

/************Анализ Simulink модели:************/

/************Условия:************/

// Уставка:
Tp0 = 160
Ti0 = 120.37
Cp0 = 67.94
Cra0 = 6.5

// Модель с н.у.:
Tp1 = 156.9966
Tp2 = 153.995
Tp3 = 150.993

Ti1 = 124.3766
Ti2 = 126.38
Ti3 = 129.385

Cp1 = 68.965
Cp2 = 69.99
Cp3 = 71.015

Ci1 = 5.57
Ci2 = 4.64
Ci3 = 3.71

// Параметры модели:
RvT = 0.0191806, RfT = 0.0000777
RvM = 0.004302, RfM = 0.00001222, E = 0.000000001

// Ф-ии нелинейных блоков
speed3 = (((0.003223135*(273+u))/24.69822264)/0.5)*u
k4 = (((0.003223135*(273+u))/24.69822264)/0.5+0.0191806)*u

// При моделировании использовалься ode1(Euler)
// Фиксированный шаг дискретизации по времени:
dt = 0.01;

// Конечное время моделирование(совпадает с конечн. врем. модел. ПМ)
simulation_time = 100000.0

/************Результаты моделирования:************/

// Установившиеся значения:
TV[i][j] = 157.0138; 153.8792; 150.5909
TF[i][j] = 124.7512; 128.9740; 133.0390

CV[i][j] = 84.7613; 105.2028; 130.8189
CF[i][j] = 3.0116; 0.2063; -2.0540

// Время отрисовки графиков
t_render = 172.67 sec

//---------------------------------------------------------
//---------------------------------------------------------

/************Сравительный анализ:************/

// Динамика одинакова, но Simulink модель выдаёт: CF[i][j] = 3.0116; 0.2063; -2.0540
// Установившиеся значения (при RvM = 0.004302, RfM = 0.00001222):
TV[i][j] = 156.494; 153.622; 148.457 
TF[i][j] = 123.79; 126.958; 129.986

CV[i][j] = 71.1377; 70.9321; 76.8917
CF[i][j] = 4.58631; 2.82093; 1.05045

// Установившиеся значения:
TV[i][j] = 157.0138; 153.8792; 150.5909
TF[i][j] = 124.7512; 128.9740; 133.0390

CV[i][j] = 84.7613; 105.2028; 130.8189
CF[i][j] = 3.0116; 0.2063; -2.0540

// Установившиеся значения:
TV[i][j] = 
TF[i][j] = 

CV[i][j] = 
CF[i][j] = 