/*
 * Отчёт по анализу – 
 * нелинейной взаимосвязанной темпло- и массообменной модели(НВТММ)(NETFM)
 * представленной в ПМ(Graphs(5part)) и Simulink модели(Full_RC_EVOP).
 * 
 * Примечание: в Simulink модели(Full_RC_EVOP) не участвует Испаритель.
 */

//---------------------------------------------------------

/************Анализ ПМ:************/

/************Условия:************/

// Модель:
// -----Model's heat exchenger parameters------
double RvT = 0.0191806, RfT = 0.0000777, a0 = 0.00016966,
        PTV_L = (a0 * 273.15 * dt) / defaultH,
        PTF = (0.0002291314 * dt) / defaultH;

// -----Model's mass exchenger parameters------
double E = 0.000000001, RfM = 0.000010734, RvM = 0.0216487318;
						// RvM = 0.004302, RfM = 0.00001222;

// -----Calculate layer heat exchenger model------
PTV_N = (a0*TV[i-1][j+1] * dt) / defaultH;
TV[i][j] = -TV[i-1][j] * (PTV_L - 1 - PTV_N + dt*RvT)
						+ (PTV_L * TV[i-1][j-1]) - (PTV_N * TV[i-1][j+1])
            			+ (dt * RvT * TF[i-1][(selectZ-1)-j])
            			+ P_TV;  // + perturbation of the temperature(P_TV = 0)
TF[i][j] = -TF[i-1][j] * (PTF - 1 + dt*RfT)
						+ (PTF * TF[i-1][j-1])
						+ (dt * RfT * TV[i-1][(selectZ-1)-j])
						+ P_TF; // (P_TF = 0)

// -----Calculate layer mass exchenger model------
CV[i][j] = -CV[i-1][j] * (PTV_L - 1 - PTV_N - dt*RvM)
						+ (PTV_L * CV[i-1][j-1])
						- (PTV_N * CV[i-1][j+1])
                        - (dt * RvM * E * CF[i-1][(selectZ-1)-j])
                        + P_CV; // (P_CV = 0)
CF[i][j] = -CF[i-1][j] * (PTF - 1 - (dt*RfM*E))
						+ (PTF * CF[i-1][j-1])
						- (dt * RfM * CV[i-1][(selectZ-1)-j])
						+ P_CF; // (P_CF = 0)

// Модель с н.у.:
const double initLayerTV_0 = 160, initLayerTV_1 = 147.99;
const double initLayerTF_0 = 120.37, initLayerTF_1 = 132.39;
const double initLayerCV_0 = 67.94, initLayerCV_1 = 72.04;
const double initLayerCF_0 = 6.5, initLayerCF_1 = 2.78;

// Шаг дискретизации по времени:
double dt = 0.01;

// Шаг дискретизации по пространству:
static double defaultH = dRC/selectZ;	// dRC = 1.4m; selectZ = 3

/************Результаты моделирования:************/

// Установившиеся значения (при RfM = 0.000010734, RvM = 0.0216487318):
TV[i][j] = 156.881; 154.017; 150.263 
TF[i][j] = 124.454; 128.493; 132.372

CV[i][j] = 108.567; 78.4895; 164.269
CF[i][j] = 2.9088; 1.19289; -1.18058

// Установившиеся значения (при RvM = 0.004302, RfM = 0.00001222):
TV[i][j] = 156.227; 153.4; 148.593 
TF[i][j] = 122.035; 124.968; 128.642

CV[i][j] = 71.1205; 70.9432; 76.9187
CF[i][j] = 5.75847; 4.88919; 3.74284

// Время отрисовки графиков
t_render = 44.23 sec

//---------------------------------------------------------
//---------------------------------------------------------

/************Анализ Simulink модели:************/

/************Условия:************/

// Уставка:
Tp0 = 160
Ti0 = 120.37
Cp0 = 67.94
Cra0 = 6.5

// Модель с н.у.:
Tp1 = 156.9966
Tp2 = 151.9933
Tp3 = 147.99

Ti1 = 124.3766
Ti2 = 128.3833
Ti3 = 132.39

Cp1 = 69.3066
Cp2 = 70.6733
Cp3 = 72.04

Ci1 = 5.26
Ci2 = 4.02
Ci3 = 2.78

// Параметры модели:
RvT = 0.0191806, RfT = 0.0000777
RvM = 0.0216487318, RfM = 0.000010734, E = 0.000000001

// Ф-ии нелинейных блоков
speed3 = (((0.003223135*(273+u))/24.69822264)/0.5)*u
k4 = (((0.003223135*(273+u))/24.69822264)/0.5+0.0191806)*u

// При моделировании использовалься ode1(Euler)
// Фиксированный шаг дискретизации по времени:
dt = 0.01;

// Конечное время моделирование(совпадает с конечн. врем. модел. ПМ)
simulation_time = 100000.0

/************Результаты моделирования:************/

// Установившиеся значения:
TV[i][j] = 157.013; 153.879; 150.590
TF[i][j] = 124.751; 128.973; 133.039

CV[i][j] = 84.761; 105.202; 130.818
CF[i][j] = 3.435; 0.971; -1.013

// Время отрисовки графиков
t_render = 16.1 sec

//---------------------------------------------------------
//---------------------------------------------------------

/************Сравительный анализ:************/

// Массообменная часть модели в ПМ при RfM = 0.000010734, RvM = 0.0216487318,
// рассходится, а установившиеся значения Simulink модели
// при этих же параметрах сильно завышены!!!